# Pandas 기초연습문제

In [2]:
import pandas as pd

## 딕셔너리를 이용하여 아래와 같은 모양이 되도록 data frame을 생성하시오.

In [3]:
# 딕셔너리의 키는 column name이 되고, 값은 dataframe의 해당열의 요소가 된다.
score={'학번':[201524213,201621223,201621233, 201611111, 201722222],
       '이름':['오지환','박용택','정성훈', '다니엘', '지민'],
       '학과':['경영정보','경영정보','경영정보','컴퓨터공학','컴퓨터공학'],
       'Quiz':[15,20,10,17,18],
       '중간고사':[20,20,15,18,16]}

df= pd.DataFrame(score)
df

          학번   이름     학과  Quiz  중간고사
0  201524213  오지환   경영정보    15    20
1  201621223  박용택   경영정보    20    20
2  201621233  정성훈   경영정보    10    15
3  201611111  다니엘  컴퓨터공학    17    18
4  201722222   지민  컴퓨터공학    18    16

In [4]:
df['학번'] # '학번' 열의 값들을 뽑아준다. int64라는 것에 주목해보자.

0    201524213
1    201621223
2    201621233
3    201611111
4    201722222
Name: 학번, dtype: int64

## 위에서 생성한 데이터프레임으로부터 인덱싱을 이용하여 이름과 중간고사를 추출하시오.

In [6]:
df[['이름', '중간고사']] # 이런식으로 괄호를 두 번 씌워야 데이터프레임 형태를 지키면서 가져갈 수 있다.

    이름  중간고사
0  오지환    20
1  박용택    20
2  정성훈    15
3  다니엘    18
4   지민    16

## reindex를 이용하여 2, 0, 4, 1, 3 순으로 순서를 변경하시오.

In [8]:
df = df.reindex([2, 0, 4, 1, 3]) # reindex로 미리 오름차순으로 정의된 index 값들을 변경해준다.
df

          학번   이름     학과  Quiz  중간고사
2  201621233  정성훈   경영정보    10    15
0  201524213  오지환   경영정보    15    20
4  201722222   지민  컴퓨터공학    18    16
1  201621223  박용택   경영정보    20    20
3  201611111  다니엘  컴퓨터공학    17    18

## iloc과 loc을 각각 이용하여 박용택 학생의 record를 추출하시오. (iloc으로 한번, loc으로 한번 수행)

In [9]:
# iloc --> index 기준
# loc --> row or column name 가지고
print(df.iloc[3]) # 4번째 행의 값을 가져와아 하기 때문에 3을 대입
print(df.loc[1]) # 위에서 인덱스 값을 바꾸었기 때문에 row name을 입력

학번      201621223
이름            박용택
학과           경영정보
Quiz           20
중간고사           20
Name: 1, dtype: object
학번      201621223
이름            박용택
학과           경영정보
Quiz           20
중간고사           20
Name: 1, dtype: object

## iloc과 loc을 각각 이용하여 모든 학생의 이름과 중간고사 점수를 추출하시오. (iloc으로 한번, loc으로 한번 수행)

In [10]:
print(df.iloc[:, [1, 4]]) # 2번째 열인 이름, 5번째 열인 중간고사를 가져온다.
print(df.loc[:, ['이름', '중간고사']]) #loc은 column name을 직접 대입해야한다.

    이름  중간고사
2  정성훈    15
0  오지환    20
4   지민    16
1  박용택    20
3  다니엘    18
    이름  중간고사
2  정성훈    15
0  오지환    20
4   지민    16
1  박용택    20
3  다니엘    18

## 중간고사 점수의 평균을 구하시오.

In [11]:
df['중간고사'].mean() # 중간고사 targetting --> mean() 사용

17.8

## 중간고사 점수가 가장 낮은 학생의 index를 구하시오

In [12]:
df['중간고사'].idxmin() # idxmin은 index 위치를 반환해주는 함수이다.

2

## 퀴즈 점수가 가장 높은 학생의 학번을 구하시오.

In [14]:
df.loc[df['Quiz'].idxmax(), '학번'] # idxmax함수로 taget된 quiz 열의 최대값의 위치를 찾고, 리턴값은 학번으로 정한다.
# df.loc[df['Quiz'].idxmax()]['학번']  # 위 코드와 동일한 효과를 낸다.

201621223

## 위 데이터프레임의 각 열에 대해서 개수, 평균, 표준편차, 최소최대값 등의 다양한 통계량을 출력하시오.

In [17]:
df.describe() # describe 함수는 각 열의 기본적인 통계량을 한 눈에 보기 쉬게 보여준다.

                 학번       Quiz       중간고사
count  5.000000e+00   5.000000   5.000000
mean   2.016200e+08  16.000000  17.800000
std    7.018995e+04   3.807887   2.280351
min    2.015242e+08  10.000000  15.000000
25%    2.016111e+08  15.000000  16.000000
50%    2.016212e+08  17.000000  18.000000
75%    2.016212e+08  18.000000  20.000000
max    2.017222e+08  20.000000  20.000000

## 위 데이터프레임을 중간고사 점수에 따라 내림차순으로 정렬하시오.¶

In [18]:
df.sort_values('중간고사', ascending=False) # sort_values함수는 내림차순 정렬 효과를 낸다.

          학번   이름     학과  Quiz  중간고사
0  201524213  오지환   경영정보    15    20
1  201621223  박용택   경영정보    20    20
3  201611111  다니엘  컴퓨터공학    17    18
4  201722222   지민  컴퓨터공학    18    16
2  201621233  정성훈   경영정보    10    15

## 학생 중에서 퀴즈 점수가 평균 이상인 학생들의 이름을 출력하시오.¶

In [19]:
quiz_mean = df['Quiz'].mean() # 우선 quiz 열의 평균 값을 구한다.
df[df['Quiz'] > quiz_mean]['이름'] # numpy array와 같이 pandas도 이와 같은 방식의 filtering을 제공한다.

4     지민
1    박용택
3    다니엘
Name: 이름, dtype: object

## 학생 중에서 퀴즈와 중간고사 점수 모두 평균 이상인 학생들의 record를 출력하시오.¶

In [20]:
quiz_mean = df['Quiz'].mean() # quiz 열의 평균
mid_mean = df['중간고사'].mean() # 중간고사 열의 평균
# 두 조건을 만족하는 df를 뽑을려면 & 연산자를 사용해야한다.
df[(df['Quiz'] > quiz_mean) & (df['중간고사'] > mid_mean)]

          학번   이름     학과  Quiz  중간고사
1  201621223  박용택   경영정보    20    20
3  201611111  다니엘  컴퓨터공학    17    18

## value_counts를 이용하여 학과 별로 학생의 수를 구하시오.

In [21]:
df['학과'].value_counts()

경영정보     3
컴퓨터공학    2
Name: 학과, dtype: int64

## groupby를 이용하여 학과 별로 중간고사의 평균을 구하시오.

In [22]:
df.groupby('학과')['중간고사'].mean() # 학과 기준으로 group by 해주고, 중간고사의 평균을 구한다.

학과
경영정보     18.333333
컴퓨터공학    17.000000
Name: 중간고사, dtype: float64

In [23]:
df.mean() # 각 열의 평균값을 뽑아준다.

학번      201620000.4
Quiz           16.0
중간고사           17.8
dtype: float64

In [24]:
list(df.groupby('학과')) # list함수는 학과 기준으로 groupby (오름차순?) 된 것을 리스트형으로 변환해준다.

[('경영정보',
            학번   이름    학과  Quiz  중간고사
  2  201621233  정성훈  경영정보    10    15
  0  201524213  오지환  경영정보    15    20
  1  201621223  박용택  경영정보    20    20),
 ('컴퓨터공학',
            학번   이름     학과  Quiz  중간고사
  4  201722222   지민  컴퓨터공학    18    16
  3  201611111  다니엘  컴퓨터공학    17    18)]